# -*- org-publish-use-timestamps-flag: nil; -*-
#+title: Mindmap
#+author: Preston Pan
#+date: <2023-06-10 Sat>
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css" />
#+html_head: <meta name="viewport" content="width=1000; user-scalable=0;" />

* Introducing: the Mindmap
Do you want to know everything like me and be a smart person instead of dumb?
Well, you've come to the right place! 👍
* [[file:../graph_view/index.html][Graph View]]
Everyone should experience the graph view of the wonderful *mindmap!!!!!*
** What is this?
It's a place that hopes to explain *EVERYTHING!!*
** Isn't that unrealistic?
I answer that in my [[file:everything.org][mindmap]]! It has all the answers!
** Doesn't it have to explain itself?
Yeah, we answered that one too. Just read the [[file:everything.org][mindmap]].
** Batteries included?
No, it's a mindmap you fucking idiot.
* Rules
- Don't use the back button on your browser
- Everything here is going to be a link to another mindmap page.
- Therefore, if there is a page you want to go back to, you must navigate until you find a loop back to the original page.
** Prerequisites
One must have an open mind, know the basics of the [[https://nullring.xyz/blog/stem.html][Stem programming language]], and have finished a high school mathematics
education. One must also know about some mathematical notation, though much of it will be explained in the articles.
** What Happens if I don't Follow the Rules?
You're ruining your own fun I guess. These are just the recommended settings
and if you want to change them then you're free to.

That won't stop me from stalking you and physically threatening you, though. Teehee!
* How did you make it?
This section of the website was made with ~org-roam~, an emacs package that allows
you to make a web of notes, something close to a wiki.

* I want to Break the Rules
No you don't. That being said, if you really want the list of all articles, here you go:
@@html: <div class="links-page">@@
#+begin_src shell :results output raw :exports both
  for f in *;
  do
      if [[ "$f" == "index.org" || "$f" == "README.org" || "$f" == *.png || "$f" == *.log ]]; then
          continue
      fi

      if [ -d "$f" ]; then
  	continue
      fi

      name="$(grep '^#+title:' "$f" | sed 's/^#+title:[[:space:]]*//')"
      printf -- "- [[file:$f][$name]]\n"
  done
#+end_src

#+RESULTS:
- [[file:central force.org][central force]]
- [[file:circuit analysis.org][circuit analysis]]
- [[file:consequentialism.org][consequentialism]]
- [[file:conservative force.org][conservative force]]
- [[file:continuity equation.org][continuity equation]]
- [[file:del operator.org][del operator]]
- [[file:derivative.org][derivative]]
- [[file:differential equation.org][differential equation]]
- [[file:dirac delta.org][dirac delta]]
- [[file:divergence theorem.org][divergence theorem]]
- [[file:duality.org][duality]]
- [[file:egoism.org][egoism]]
- [[file:electrostatics.org][electrostatics]]
- [[file:emergence.org][emergence]]
- [[file:everything.org][everything]]
- [[file:factorial.org][factorial]]
- [[file:Fourier Transform.org][Fourier Transform]]
- [[file:framework.org][framework]]
- [[file:function.org][function]]
- [[file:group.org][group]]
- [[file:Heaviside Step Function.org][Heaviside Step Function]]
- [[file:Hilbert Space.org][Hilbert Space]]
- [[file:IAK.org][IAK]]
- [[file:IEEDI.org][IEEDI]]
- [[file:induction.org][induction]]
- [[file:infinity.org][infinity]]
- [[file:inheritance.org][inheritance]]
- [[file:inner product space.org][inner product space]]
- [[file:inverse square.org][inverse square]]
- [[file:Kirchhoff's Laws.org][Kirchhoff's Laws]]
- [[file:L_{2} space.org][L_{2} space]]
- [[file:Lagrangian mechanics.org][Lagrangian mechanics]]
- [[file:Laplace Transform.org][Laplace Transform]]
- [[file:Legendre Transformation.org][Legendre Transformation]]
- [[file:limit.org][limit]]
- [[file:logic.org][logic]]
- [[file:Lorentz Force.org][Lorentz Force]]
- [[file:LRC circuit.org][LRC circuit]]
- [[file:magnetostatics.org][magnetostatics]]
- [[file:mathematics.org][mathematics]]
- [[file:Maxwell's Equations.org][Maxwell's Equations]]
- [[file:metric space.org][metric space]]
- [[file:natural number.org][natural number]]
- [[file:Newtonian mechanics.org][Newtonian mechanics]]
- [[file:normed vector space.org][normed vector space]]
- [[file:Ohm's Law.org][Ohm's Law]]
- [[file:partial derivative.org][partial derivative]]
- [[file:philosophy.org][philosophy]]
- [[file:physics.org][physics]]
- [[file:quantum mechanics.org][quantum mechanics]]
- [[file:recursion.org][recursion]]
- [[file:self-assembly.org][self-assembly]]
- [[file:special relativity.org][special relativity]]
- [[file:stack.org][stack]]
- [[file:vector space.org][vector space]]
@@html: </div>@@
